{
    "cfwVersion": "3.0_rc1",
    "date": "2025-06-03",
    "buildTimestamp": 1748992604.561495,
    "notes": "X1Plus version 3.0 release candidate, supporting Bambu Lab X1 and X1 Carbon printers.\n\nIn this release:\n  * Updated to Bambu Lab base firmware 01.08.02.00.\n  * Added support for X1Plus Expander (https://accelerated.tech/expander/),\n    including:\n    - support for I2C sensors: SHT41, AHT20, PMSA003I, TCA8418;\n    - support for LED strips;\n    - support for the Andon module;\n    - and support for a camera shutter release.\n  * Added support for Bambu Lab (and custom) filament database updates, and\n    imported default filament version of 02.00.00.89.\n  * Added the X1Plus Actions subsystem, allowing actions triggered by\n    printer events, GPIOs, and by Gcode commands.\n  * Updated AMS firmware to 00.00.06.44.\n  * Added dynamic module loading system into x1plusd (thanks\n    @WolfwithSword!).\n  * Disabled by default some services that did not support authentication.\n  * Added option to toggle chamber light with hardware buttons (thanks\n    @phillipthelen!).\n  * Added support for USB ethernet adapters, including X1Plus Expander.\n  * Fixed Bambu firmware bug with selecting TPU for AMS on device.\n  * Hopefully remembered to build the Mac installer for Intel, not just\n    ARM64.\n\nBehind the scenes:\n  * Added an experimental httpd with a WebSocket interface (disabled by\n    default).\n  * Added a mechanism to capture traffic between the AP and MC.\n  * Added support for some other WiFi modules, if you have for some reason\n    taken a hot air rework station to your AP (thanks, @balika011!).\n\nKnown issues:\n  * We have seen X1Plus settings get erased after some installs.  Please let\n    us know if you see this issue.\n  * Actions from Gcode may infrequently fail to trigger, especially if the\n    printer is under heavy load.",
    "ota_url": "https://github.com/X1Plus/X1Plus/releases/download/x1plus%2F3.0_rc1/3.0_rc1.x1p",
    "ota_md5": "c3be7169792f2c2e47455509afe4e6ea",
    "base_update_url": "https://public-cdn.bblmw.com/upgrade/device/BL-P001/01.08.02.00/product/e750866b34/update-v00.00.32.39-20240805174856_product.img.zip.sig",
    "base_update_md5": "1e1003789a9ea7326c206aa99c174632"
}