{
    "cfwVersion": "2.0_rc0",
    "date": "2024-06-10",
    "buildTimestamp": 1717998254.200542,
    "notes": "X1Plus version 2.0 release candidate, supporting Bambu Lab X1 and X1 Carbon printers.\n\nNOTE: Upon installation, this release candidate will immediately prompt that an update is available!  This is expected, and is intended to test the update system.  Although the updated version will be functionally identical to this version, please install the update to help us test the updater.\n\nIn this release:\n  * Updated to Bambu Lab base firmware version 01.08.00.00.\n  * Added the X1Plus update engine, which now can download new versions and upgrade X1Plus entirely without a host computer.\n  * Added an option to run the VNC server simultaneously with the on-printer display.\n  * Added translations for Portuguese and Turkish (thanks to Fatih AYDIN and HtheB!).\n  * Added a WiFi compatibility mode.\n  * Added command history to the console.\n  * Added support for cron jobs (thanks to Miguel Piedrafita).\n  * Added visual indicator for axis homing.\n  * Added a option to debug the early boot process.\n  * Improved lead screw maintenance dialog UX.\n  * Fixed a bug in which the lock screen can get 'stuck' in certain cases.\n  * Fixed a bug in which higher WiFi channels were not usable in countries that allowed them.\n  * Many internal changes to prepare for the future, including moving X1Plus background operations to a new `x1plusd` daemon.\n\nKnown issues:\n  * We have occasionally seen WiFi disconnect, and not recover until the printer was restarted.  Please let us know if you see this issue.\n  * Some recently added text has not yet been translated.",
    "ota_url": "https://github.com/X1Plus/X1Plus/releases/download/x1plus%2F2.0_rc0/2.0_rc0.x1p",
    "ota_md5": "a4f361a465e347ae906eb512a14bb94c",
    "base_update_url": "https://public-cdn.bblmw.com/upgrade/device/BL-P001/01.08.00.00/product/45ea644d25/update-v00.00.32.18-20240422102213_product.img.zip.sig",
    "base_update_md5": "af197ded334dea01e5ce95ee56155e0a"
}